
    
    [{"authors":null,"categories":null,"content":" This webpage aims to facilitate the teaching and learning of Biochemistry content and related fields within the framework of Reproducible Education (RE). It provides self-directed learning materials that integrate topic exploration with the execution of freely available software. These software tools, including R, RStudio, Jmol, and Sisma, offer functionalities for generating graphs, analyses, tables, simulations, and animations. Notably, Sisma, developed at UNIFAL-MG, allows for dynamic observation of responses and metabolic networks.\nThe selection of these software programs adheres to the principles of RE. Emphasis is placed on features such as flexibility, expandability, a user-friendly learning curve, intuitive usability, interactive elements, ease of installation or web browser accessibility, and broad applicability for both teaching (in various formats such as in-person, remote, hybrid, or distance learning) and research endeavors.\nAlternatively, users can access some diverse content on Biochemistry topics from the textbook Bioquímica básica, de gente, de bicho, e de planta (ISBN: 978-65-00-90366-9), still in Portuguese.\nIn development there is also a content, also still in Portuguese, for creating texts and teaching objects aligned with RE principles. This initiative involves the generation of dynamic documents with R and RStudio, drawing upon the concept of literate programming.\n","date":-62135596800,"expirydate":-62135596800,"kind":"term","lang":"en","lastmod":-62135596800,"objectID":"2525497d367e79493fd32b198b28f040","permalink":"","publishdate":"0001-01-01T00:00:00Z","relpermalink":"","section":"authors","summary":"This webpage aims to facilitate the teaching and learning of Biochemistry content and related fields within the framework of Reproducible Education (RE). It provides self-directed learning materials that integrate topic exploration with the execution of freely available software.","tags":null,"title":"","type":"authors"},{"authors":null,"categories":null,"content":" Página elaborada no intuito de contribuir para o ensino-aprendizagem de conteúdos de Bioquímica e áreas correlatas, e esboçada para um Ensino Reproduzível (ER). O material autoinstrucional permite o estudo dos temas juntamente à execução de códigos de programas de livre distribuição para gráficos, análises e tabelas, simulações e animações (R \u0026amp; RStudio), como para o estudo e visualização tridimensional de biomoléculas (Jmol), e para a observação dinâmica de reações e redes metabólicas (Sisma, desenvolvido na UNIFAL-MG).\nA seleção dos programas baseia-se em suas características tangentes a um Ensino Reproduzível galgado na flexibilidade, expansibilidade, rápida curva de aprendizado, boa useabilidade, interatividade, fácil instalação ou uso por navegadores de internete, e larga aplicabilidade, tanto para ensino (presencial, remoto, híbrido, ou EaD), como para pesquisa.\nAlternativamente, pode-se acessar um conteúdo extraído do livro Bioquímica básica, de gente, de bicho, e de planta (ISBN 978-65-00-90366-9), sobre diversos temas em Bioquímica.\n","date":-62135596800,"expirydate":-62135596800,"kind":"page","lang":"en","lastmod":-62135596800,"objectID":"8c3eb507e3521814335dabedef0505ad","permalink":"","publishdate":"0001-01-01T00:00:00Z","relpermalink":"","section":"authors","summary":"Página elaborada no intuito de contribuir para o ensino-aprendizagem de conteúdos de Bioquímica e áreas correlatas, e esboçada para um Ensino Reproduzível (ER). O material autoinstrucional permite o estudo dos temas juntamente à execução de códigos de programas de livre distribuição para gráficos, análises e tabelas, simulações e animações (R \u0026 RStudio), como para o estudo e visualização tridimensional de biomoléculas (Jmol), e para a observação dinâmica de reações e redes metabólicas (Sisma, desenvolvido na UNIFAL-MG).","tags":null,"title":"","type":"authors"}]